---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ZoneFailures.ZoneExistsNotEnclosedRoom
source: html/cd8f390c-ddac-8823-4fd0-a3850b735e4e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ZoneFailures.ZoneExistsNotEnclosedRoom Property

Zone has a room not enclosed.

## Syntax (C#)
```csharp
public static FailureDefinitionId ZoneExistsNotEnclosedRoom { get; }
```